# SUGGESTION_NUMS = 5
LEFT_SCALES_NUMS = 3
RIGHT_SCALES_NUMS = 3
ITEMS_EXCEL_LOCATION = f'ASTLIBRA_items.xlsx'

score_of_item_id = {
    0: 50,  # "最大體力"
    1: 48,  # "精力提升量"
    2: 46,  # "效果時間"
    3: 44,  # "體力回復量"
    4: 42,  # "使用速度"
    5: 40,  # "重量減輕"
    6: 38,  # "經驗獲取"
    7: 36,  # "金錢獲取"
    8: 80,  # "攻擊力"
    9: 75,  # "防禦力"
    10: 5, # "格擋耐久"
    11: 20, # "異常耐性"
    12: 10, # "適應力"
    13: 8,  # "魔導力"
    14: 6,  # "最大精力"
    15: 4,  # "緩慢回復"
}

items_wheter_holding = [ # (weight, item_name, YES/NO)
    (2, "銅の箱の鍵", 1),
    (3, "原木", 1),
    (5, "おたまじゃくし", 1),
    (5, "クコの実", 1),
    (6, "ゴブリンの石版", 1),
    (6, "マンドラゴラ", 1),
    (7, "スライムの目玉", 1),
    (8, "クモの巣", 1),
    (8, "石ころ", 1),
    (8, "空の小瓶", 1),
    (8, " 綺麗な骨", 1),
    (8, "銅鉱石", 1),
    (8, "鍵型A", 1),
    (9, "木のつるはし", 1),
    (9, "鉄鉱石", 1),
    (10, "木炭", 1),
    (10, "気持ち悪い肉", 1),
    (10, "野宿セット", 1),
    (11, "アイアンインゴット", 1),
    (11, "カッパーインゴット", 1),
    (11, "コウモリの羽", 1),
    (11, "亀の甲羅", 1),
    (11, "木の矢", 1),
    (12, "スポンジケーキ", 1),
    (12, " ソーマ", 1),
    (12, "パイ生地", 1),
    (13, "ミノタウロスの斧", 1),
    (13, "刺身", 1),
    (13, "木のどくろ", 1),
    (15, "イガの実", 1),
    (15, "カニかま", 1),
    (16, "たいまつ", 1),
    (16, "スタミナのカード", 1),
    (16, "小麦粉", 1),
    (16, "特効薬の実", 0),
    (17, "木棒の束", 0),
    (17, "松脂の入った一斗缶", 1),
    (17, "石版の欠片", 0),
    (18, "たまごパン", 1),
    (18, "ゴーレムの破片", 1),
    (18, "空の中瓶", 1),
    (18, "鍵型B", 1),
    (19, "くさいエラ", 1),
    (19, "爆弾", 1),
    (19, "石のつるはし", 1),
    (19, "精錬 キット", 1),
    (19, "金鉱石", 1),
    (20, "チクの実", 1),
    (20, "水の入った小瓶", 0), # 6
    (21, "デーモンの角", 1),
    (21, "矢の束", 1),
    (22, "あんきも", 1),
    (22, "クモのおしり", 0), # 7
    (22, "ネクタル", 1),
    (22, "ノウメ", 1),
    (22, "金の箱の鍵", 1),
    (23, " バター", 1),
    (23, "双属性の核", 0), # 7
    (23, "汚い牙", 1),
    (23, "銀のどくろ", 1),
    (23, "銀の箱の鍵", 1),
    (24, "たまご", 1),
    (24, "ゴールドインゴット", 1),
    (24, "体力のカード", 1),
    (24, "木製のブーメラン", 1),
    (24, "枯れた伝説の薬草", 0),
    (25, "ポインセチア", 1), # 2
    (25, "廃熱器官", 1),
    (25, "粘土岩", 1),
    (26, "モキュンのぬいぐるみ", 1),
    (26, "樹獣のコケきのこ", 0), # 7
    (26, "環境のカード", 1),
    (26, " 聖水", 1),
    (26, "防御力のカード", 1),
    (27, "強靭な足肉", 0), # 7
    (27, "鷹の羽", 1),
    (28, "シュークリーム", 1),
    (28, "マモンの足", 1),
    (28, "投げナイフ", 1),
    (28, "空の大瓶", 1),
    (28, "虫の足", 0), # 7
    (29, "アヌリスのリボン", 1),
    (29, "ブレッド", 1),
    (29, "ホットケーキ", 1),
    (29, "世界樹の雫", 1),
    (29, "痺れ取り薬", 1),
    (29, "鉄のつるはし", 1),
    (29, "高炭素鋼鉱石", 1),
    (30, "ザッハトルテ", 0), # 9
    (30, " 目薬", 1),
    (31, "バッテリー", 0), # 8
    (31, "バネ", 0), # 8
    (31, "ペンギンのたまご", 0), # 6
    (31, "栗", 1),
    (31, "溶岩石ころ", 1),
    (32, "アムリタ", 1),
    (32, "ブルーオーブ", 1),
    (32, "攻撃力のカード", 1),
    (33, "リセットポーション", 0), # 11?
    (33, "妖樹の枝", 0), # 7
    (33, "金のどくろ", 1),
    (34, "ダマスカスインゴット", 1),
    (34, "チョコソフト", 1),
    (34, "ヴィジャヤ", 1),
    (34, "止血薬", 1),
    (34, "綺麗な氷", 0), # 6
    (35, "ネ ジ", 0), # 8
    (35, "血清", 1),
    (36, "スライムゼリー", 0), # 6
    (36, "ランタン", 1),
    (36, " リザードの鱗", 1),
    (36, "神父の日記", 1),
    (36, "魔力のカード", 1),
    (37, "ギア", 0), # 8
    (37, "バッタの羽", 0), # 7
    (38, "だんご", 1),
    (38, "ハンバーガー", 0), # 6
    (38, "銀粘石", 1),
    (38, "鏡の欠片", 0), # 6
    (39, "アダマン剛石", 0), # 7
    (39, "チーズ", 1),
    (39, "チーズケーキ", 1),
    (39, "火薬弾", 1),
    (39, "魔法銀鉱石", 0), # 6
    (40, "もち", 1),
    (40, "ガーゴイルの翼", 1),
    (40, "ジェネラルケーキ", 1),
    (40, "フサの実", 0), # 7
    (40, "水の入った中瓶", 0), # 6
    (41, "プレーンクッキー", 1),
    (42, "ドグの実", 0), # 11
    (43, "いちご", 1),
    (43, "りんご", 1),
    (43, "チョコチップクッキー", 1),
    (43, "魔導 の壺", 0), # 6
    (44, "ソフトクリーム", 1),
    (44, "ミスリル", 0), # 6 
    (44, "俊敏のカード", 1),
    (45, "イエティの毛", 0), # 6
    (45, "ストロベリークレープ", 1),
    (45, "トズーパ", 1),
    (46, "ボルト", 0), # 8
    (46, "古代魚の切り身", 0), # 6
    (47, "ケーブル", 0), # 8
    (47, " 神々しい翼", 0), # 6
    (48, "あんまんじゅう", 0), # 7
    (48, "チョコシュー", 1),
    (48, "ミ ルク", 1),
    (49, "ヒヒイロカネ", 0), # 畫
    (49, "ミルクココア", 0), # 6
    (49, "モンブラン", 1),
    (50, "ミートパイ", 0), # 6
    (50, "動力炉", 0), # 8
    (50, "火薬", 1),
    (51, "ジャムクッキー", 0), # 7
    (51, "リスパダールの盾", 0), # 6
    (52, "アンブロシア", 0), # 6
    (52, "金粘石", 1),
    (54, "アダマンタイト", 0), # 7
    (54, "伝説の薬草", 0),
    (54, "幸運のカード", 0), # 打不到
    (54, "王城のりんご", 0),
    (55, "エラメルド", 1),
    (55, "奥義封印メダル", 1),
    (55, "心臓", 0), # 8
    (55, "日記の切れ端", 1),
    (56, "リンゴパイ", 1),
    (56, "水晶のつるはし", 1),
    (57, "ショートケーキ", 1),
    (58, "ジャムパン", 1),
    (59, "あんころ餅", 0), # 7
    (60, "ココアクッキー", 0), # 6
    (60, "バレンタインケーキ", 0), # 7
    (60, "水の入った大瓶", 0), # 6
    (61, "牛肉", 0), # 6
    (63, "いちごオレ", 1),
    (63, "ストロベリークリー ム", 0), # 7
    (63, "チョコパイ", 1), # 合成
    (64, "オリハルコン", 1), # 畫 合成
    (64, "ココア", 0), # 6
    (64, "チョコケーキ", 0), # 7 屋子合成
    (65, "サファアイ", 1),
    (66, "あんこ", 0), # 7
    (66, "抹茶ソフト", 0), # 7
    (67, "抹茶オレ", 0), # 7
    (68, "カロンの書\u300036巻(旅)", 1),
    (68, "魔神の つるはし", 0), # 11
    (70, "純白のお召し物", 1),
    (74, "りんご飴", 0), # 7
    (74, "チョコレ ート", 1), # 拆解商店出售的巧克力蛋糕獲得
    (75, "ビルー", 0), # 7
    (78, "茶葉", 0), # 7
    (85, "わたあめ", 0), # 5地底世界 6幽世
    (85, "ダヤイ モンド", 0), # 封印畫
    (86, "デコレーションケーキ", 0), # 7
    (90, "バレンタインプレゼント", 0), # 7
    (91, "砂糖", 0), # 5地底世界 6幽世
    (92, "原初の欠片", 0), # 11
    (98, "いちごジャム", 0), # 5地底世界 6幽世
]
